<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Uses parent pkg recipe to download latest Acrobat Acrobat Reader DC and import it into the JSS.</string>
        <key>Identifier</key>
        <string>com.github.beatlemike.jss.AdobeAcrobatReaderDC</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Adobe Acrobat Reader DC</string>
            <key>CATEGORY</key>
            <string>Adobe</string>
            <key>POLICY_CATEGORY</key>
            <string>Adobe</string>
            <key>POLICY_TRIGGER</key>
            <string>acrobat</string>
            <key>POLICY_TEMPLATE</key>
            <string>%RECIPE_DIR%/PolicyTemplate.xml</string>
            <key>ICON</key>
            <string>%RECIPE_DIR%/AdobeAcrobatReaderDC.png</string>
            <key>DESCRIPTION</key>
            <string>Adobe Acrobat Reader DC software is the free global standard for reliably viewing, printing, and commenting on PDF documents.</string>
            <key>DISABLE_CODE_SIGNATURE_VERIFICATION</key>
        	<string>True</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.4.0</string>
        <key>ParentRecipe</key>
        <string>com.github.rtrouton.pkg.AdobeReaderDC</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>prod_name</key>
                    <string>%NAME%</string>
                    <key>category</key>
                    <string>%CATEGORY%</string>
                    <key>policy_category</key>
                    <string>%POLICY_CATEGORY%</string>
                    <key>trigger_other</key>
                    <string>%POLICY_TRIGGER%</string>
                    <key>policy_template</key>
                    <string>%POLICY_TEMPLATE%</string>
                    <key>self_service_icon</key>
                    <string>%ICON%</string>
                    <key>self_service_description</key>
                    <string>%DESCRIPTION%</string>
                </dict>
                <key>Processor</key>
                <string>JSSImporter</string>
            </dict>
        </array>
    </dict>
</plist>
