<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Uses parent pkg recipe to download latest Acrobat Acrobat Reader DC Update and import it into the JSS.</string>
        <key>Identifier</key>
        <string>com.github.beatlemike.jss.AdobeAcrobatReaderDCUpdate</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Adobe Acrobat Reader DC Update</string>
            <key>CATEGORY</key>
            <string>Adobe</string>
            <key>DISABLE_CODE_SIGNATURE_VERIFICATION</key>
        	<string>True</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.4.0</string>
        <key>ParentRecipe</key>
        <string>com.github.novaksam.pkg.AdobeAcrobatReaderDCUpdates</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>prod_name</key>
                    <string>%NAME%</string>
                    <key>category</key>
                    <string>%CATEGORY%</string>
                </dict>
                <key>Processor</key>
                <string>JSSImporter</string>
            </dict>
        </array>
    </dict>
</plist>
