<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the current version of AppCleaner and uploads it to the JSS.</string>
        <key>Identifier</key>
        <string>com.github.beatlemike.jamf.AppCleaner</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>AppCleaner</string>
            <key>CATEGORY</key>
            <string>Utilities</string>
            <key>POLICY_CATEGORY</key>
            <string>Utilities</string>
			<key>POLICY_NAME</key>
			<string>Install - %NAME%</string>
			<key>POLICY_TEMPLATE</key>
			<string>JamfPolicyTemplateNoScope.xml</string>
            <key>SELF_SERVICE_DESCRIPTION</key>
            <string>AppCleaner is a small application which allows you to thoroughly uninstall unwanted apps.</string>
            <key>SELF_SERVICE_ICON</key>
            <string>AppCleaner.png</string>
            <key>POLICY_TRIGGER</key>
            <string>appcleaner</string>
        	<key>UPDATE_PREDICATE</key>
			<string>pkg_uploaded == False</string>
        </dict>
		<key>MinimumVersion</key>
		<string>2.3</string>
		<key>ParentRecipe</key>
        <string>com.github.haircut.pkg.AppCleaner</string>
        <key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>pkg_category</key>
					<string>%CATEGORY%</string>
				</dict>
				<key>Processor</key>
				<string>com.github.grahampugh.jamf-upload.processors/JamfPackageUploader</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>predicate</key>
					<string>%UPDATE_PREDICATE%</string>
				</dict>
				<key>Processor</key>
				<string>StopProcessingIf</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>icon</key>
					<string>%SELF_SERVICE_ICON%</string>
					<key>policy_name</key>
					<string>%POLICY_NAME%</string>
					<key>policy_template</key>
					<string>%POLICY_TEMPLATE%</string>
					<key>replace_policy</key>
					<string>True</string></dict>
				</dict>
				<key>Processor</key>
				<string>com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader</string>
			</dict>
		</array>
	</dict>
</plist>

