<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the current release version of Apple Xerox Printer Drivers and uploads it to the JSS.</string>
        <key>Identifier</key>
        <string>com.github.beatlemike.jss.AppleHPPrinterDrivers</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Apple XP Printer Drivers</string>
            <key>CATEGORY</key>
            <string>Printers</string>
            <key>POLICY_CATEGORY</key>
            <string>Printers</string>
            <key>POLICY_TRIGGER</key>
            <string>xerox</string>
            <key>POLICY_TEMPLATE</key>
            <string>%RECIPE_DIR%/PolicyTemplate.xml</string>
            <key>ICON</key>
            <string>%RECIPE_DIR%/AppleHPPrinterDrivers.png</string>
            <key>DESCRIPTION</key>
            <string>Installs the latest software for your HP printer or scanner.</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.2.0</string>
        <key>ParentRecipe</key>
        <string>com.github.novaksam.pkg.AppleHPPrinterDrivers</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>prod_name</key>
                    <string>%NAME%</string>
                    <key>category</key>
                    <string>%CATEGORY%</string>
                    <key>policy_category</key>
                    <string>%POLICY_CATEGORY%</string>
                    <key>trigger_other</key>
                    <string>%POLICY_TRIGGER%</string>
                    <key>policy_template</key>
                    <string>%POLICY_TEMPLATE%</string>
                    <key>self_service_icon</key>
                    <string>%ICON%</string>
                    <key>self_service_description</key>
                    <string>%DESCRIPTION%</string>
                </dict>
                <key>Processor</key>
                <string>JSSImporter</string>
            </dict>
        </array>
    </dict>
</plist>
