<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Uses parent pkg recipe to download latest Audacity and import it into the JSS.</string>
	<key>Identifier</key>
	<string>com.github.beatlemike.jss.audacity</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Audacity</string>
        <key>CATEGORY</key>
        <string>Audio</string>
        <key>POLICY_CATEGORY</key>
        <string>Audio</string>
        <key>POLICY_TRIGGER</key>
        <string>audacity</string>
        <key>POLICY_TEMPLATE</key>
        <string>%RECIPE_DIR%/PolicyTemplate.xml</string>
        <key>ICON</key>
        <string>%RECIPE_DIR%/Audacity.png</string>
        <key>DESCRIPTION</key>
        <string>Audacity is a free and open-source digital audio editor and recording application software.</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.4.0</string>
        <key>ParentRecipe</key>
        <string>com.github.beatlemike.pkg.audacity</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>prod_name</key>
                    <string>%NAME%</string>
                    <key>category</key>
                    <string>%CATEGORY%</string>
                    <key>policy_category</key>
                    <string>%POLICY_CATEGORY%</string>
                    <key>trigger_other</key>
                    <string>%POLICY_TRIGGER%</string>
                    <key>policy_template</key>
                    <string>%POLICY_TEMPLATE%</string>
                    <key>self_service_icon</key>
                    <string>%ICON%</string>
                    <key>self_service_description</key>
                    <string>%DESCRIPTION%</string>
                </dict>
                <key>Processor</key>
                <string>JSSImporter</string>
            </dict>
        </array>
    </dict>
</plist>
