<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>com.github.beatlemike.jamf.Discord</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Discord</string>
        <key>CATEGORY</key>
        <string>Communication</string>
        <key>POLICY_CATEGORY</key>
        <string>Communication</string>
		<key>POLICY_NAME</key>
		<string>Install - %NAME%</string>
		<key>POLICY_TEMPLATE</key>
		<string>JamfPolicyTemplateAllUsers.xml</string>
        <key>SELF_SERVICE_DESCRIPTION</key>
        <string>Discord is the easiest way to talk over voice, video, and text. Talk, chat, hang out, and stay close with your friends and communities.</string>
        <key>SELF_SERVICE_ICON</key>
        <string>Discord.png</string></dict>
        <key>POLICY_TRIGGER</key>
        <string>discord</string>
		<key>UPDATE_PREDICATE</key>
		<string>pkg_uploaded == False</string>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.beatlemike.pkg.Discord</string>
        <key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>pkg_category</key>
					<string>%CATEGORY%</string>
				</dict>
				<key>Processor</key>
				<string>com.github.grahampugh.jamf-upload.processors/JamfPackageUploader</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>predicate</key>
					<string>%UPDATE_PREDICATE%</string>
				</dict>
				<key>Processor</key>
				<string>StopProcessingIf</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>icon</key>
					<string>%SELF_SERVICE_ICON%</string>
					<key>policy_name</key>
					<string>%POLICY_NAME%</string>
					<key>policy_template</key>
					<string>%POLICY_TEMPLATE%</string>
				</dict>
				<key>Processor</key>
				<string>com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader</string>
			</dict>
		</array>
	</dict>
</plist>
