<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Docker for Apple Silicon and creates a package.</string>
	<key>Identifier</key>
	<string>com.github.beatlemike.pkg.DockerARM</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Docker for Apple Silicon</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.beatlemike.download.DockerARM</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
			<key>pkg_path</key>
            <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
		</dict>
	</array>
</dict>
</plist>
