<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Docker for Apple Silicon and imports it into your JSS.</string>
	<key>Identifier</key>
	<string>com.github.beatlemike.jss.DockerARM</string>
	<key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Docker for Apple Silicon</string>
        <key>CATEGORY</key>
        <string>Developer Tools</string>
        <key>POLICY_CATEGORY</key>
        <string>Developer Tools</string>
        <key>POLICY_TRIGGER</key>
        <string>docker</string>
        <key>POLICY_TEMPLATE</key>
        <string>%RECIPE_DIR%/PolicyTemplate.xml</string>
        <key>ICON</key>
        <string>%RECIPE_DIR%/Docker.png</string>
        <key>DESCRIPTION</key>
        <string>Docker Desktop is an application for MacOS and Windows machines for the building and sharing of containerized applications and microservices.</string>
    </dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.beatlemike.pkg.DockerARM</string>
	<key>Process</key>
	<array>
		<dict>
            <key>Arguments</key>
            <dict>
                <key>prod_name</key>
                <string>%NAME%</string>
                <key>category</key>
                <string>%CATEGORY%</string>
                <key>policy_category</key>
                <string>%POLICY_CATEGORY%</string>
                <key>trigger_other</key>
                <string>%POLICY_TRIGGER%</string>
                <key>policy_template</key>
                <string>%POLICY_TEMPLATE%</string>
                <key>self_service_icon</key>
                <string>%ICON%</string>
                <key>self_service_description</key>
                <string>%DESCRIPTION%</string>
            </dict>
            <key>Processor</key>
            <string>JSSImporter</string>
        </dict>
	</array>
</dict>
</plist>
