<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the current release version of Eclipse Temurin 11 and uploads it to the JSS.</string>
        <key>Identifier</key>
        <string>com.github.beatlemike.jss.EclipseTemurin11</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Eclipse Temurin 11</string>
            <key>FEATURE_VERSION</key>
            <string>11</string>
            <key>CATEGORY</key>
            <string>Additional Installs</string>
            <key>POLICY_CATEGORY</key>
            <string>Additional Installs</string>
            <key>POLICY_TRIGGER</key>
            <string>jdk</string>
            <key>POLICY_TEMPLATE</key>
            <string>%RECIPE_DIR%/PolicyTemplate.xml</string>
            <key>ICON</key>
            <string>%RECIPE_DIR%/EclipseTemurin.png</string>
            <key>DESCRIPTION</key>
            <string>Java is the world's leading programming language and platform. The Adoptium Working Group promotes and supports high-quality, TCK certified runtimes and associated technology for use across the Java ecosystem.</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.2.0</string>
        <key>ParentRecipe</key>
        <string>com.github.grahampugh.recipes.pkg.EclipseTemurin-11-installer</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>prod_name</key>
                    <string>%NAME%</string>
                    <key>category</key>
                    <string>%CATEGORY%</string>
                    <key>policy_category</key>
                    <string>%POLICY_CATEGORY%</string>
                    <key>trigger_other</key>
                    <string>%POLICY_TRIGGER%</string>
                    <key>policy_template</key>
                    <string>%POLICY_TEMPLATE%</string>
                    <key>self_service_icon</key>
                    <string>%ICON%</string>
                    <key>self_service_description</key>
                    <string>%DESCRIPTION%</string>
                </dict>
                <key>Processor</key>
                <string>JSSImporter</string>
            </dict>
        </array>
    </dict>
</plist>
