<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Uses parent pkg recipe to download the latest version of EquatIO and import it into the JSS.</string>
        <key>Identifier</key>
        <string>com.github.beatlemike.jss.EquatIO</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>EquatIO</string>
            <key>CATEGORY</key>
            <string>Utilities</string>
            <key>POLICY_CATEGORY</key>
            <string>Utilities</string>
            <key>POLICY_TRIGGER</key>
            <string>equatio</string>
            <key>POLICY_TEMPLATE</key>
            <string>%RECIPE_DIR%/PolicyTemplate.xml</string>
            <key>ICON</key>
            <string>%RECIPE_DIR%/EquatIO.png</string>
            <key>DESCRIPTION</key>
            <string>EquatIO is a math application that allows you to insert, edit, and interact with digital math in Microsoft Word.</string>
        </dict>
        <key>MinimumVersion</key>
        <string>1.0.1</string>
        <key>ParentRecipe</key>
        <string>com.github.beatlemike.download.EquatIO</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>prod_name</key>
                    <string>%NAME%</string>
                    <key>pkg_path</key>
                    <string>%RECIPE_CACHE_DIR%/downloads</string>
                    <key>category</key>
                    <string>%CATEGORY%</string>
                    <key>policy_category</key>
                    <string>%POLICY_CATEGORY%</string>
                    <key>trigger_other</key>
                    <string>%POLICY_TRIGGER%</string>
                    <key>policy_template</key>
                    <string>%POLICY_TEMPLATE%</string>
                    <key>self_service_icon</key>
                    <string>%ICON%</string>
                    <key>self_service_description</key>
                    <string>%DESCRIPTION%</string>
                </dict>
                <key>Processor</key>
                <string>JSSImporter</string>
            </dict>
        </array>
    </dict>
</plist>
