<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest ESET Remote Administrator Agent disk image and builds a package.</string>
	<key>Identifier</key>
	<string>com.github.beatlemike.pkg.ESETRemoteAdministratorAgent</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>ESET Remote Administrator Agent</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>ParentRecipe</key>
	<string>com.github.jbaker10.pkg.ESETRemoteAdministratorAgent</string>
	<key>Process</key>
    <array>
		<dict>
            <key>Processor</key>
            <string>Versioner</string>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg/Agent-MacOSX-x86_64.pkg/Contents/Info.plist</string>
            </dict>
        </dict>        
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg/Resources/Installer.pkg</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
            </dict>
        </dict>
    </array>
</dict>
