<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of ESET Remote Administrator Agent for macOS, mounts the DMG, and extracts the Installer.pkg.</string>
    <key>Identifier</key>
    <string>com.github.beatlemike.pkg.ESETRemoteAdministratorAgent</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>ESET Remote Administrator Agent</string>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.jbaker10.download.ESETRemoteAdministratorAgent</string>
    <key>Process</key>
      <array>
         <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg/*.pkg</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/downloads/unpack/%NAME%.pkg</string>
            </dict>
		</dict>
      </array>
   </dict>
</plist>