<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Uses parent pkg recipe to download latest Firefox and import it into the JSS.</string>
        <key>Identifier</key>
        <string>com.github.beatlemike.jss.FirefoxESR</string>
        <key>Input</key>
        <dict>
            <key>DISABLE_CODE_SIGNATURE_VERIFICATION</key>
			<false/>
			<key>DOWNLOAD_URL</key>
			<string>https://download.mozilla.org/?product=firefox-esr-next-latest-ssl&amp;os=osx&amp;lang=en-US</string>
			<key>NAME</key>
            <string>Mozilla FirefoxESR</string>
			<key>RELEASE</key>
			<string>esr-latest</string>
            <key>CATEGORY</key>
            <string>Browsers</string>
            <key>POLICY_CATEGORY</key>
            <string>Browsers</string>
            <key>POLICY_TRIGGER</key>
            <string>firefoxesr</string>
            <key>POLICY_TEMPLATE</key>
            <string>%RECIPE_DIR%/PolicyTemplate.xml</string>
            <key>ICON</key>
            <string>%RECIPE_DIR%/Firefox.png</string>
            <key>DESCRIPTION</key>
            <string>Mozilla Firefox ESR is intended for groups who deploy and maintain the desktop environment in large organizations such as schools, governments and businesses.</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.4.0</string>
        <key>ParentRecipe</key>
        <string>com.github.rtrouton.pkg.Firefox</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>prod_name</key>
                    <string>%NAME%</string>
                    <key>category</key>
                    <string>%CATEGORY%</string>
                    <key>policy_category</key>
                    <string>%POLICY_CATEGORY%</string>
                    <key>trigger_other</key>
                    <string>%POLICY_TRIGGER%</string>
                    <key>policy_template</key>
                    <string>%POLICY_TEMPLATE%</string>
                    <key>self_service_icon</key>
                    <string>%ICON%</string>
                    <key>self_service_description</key>
                    <string>%DESCRIPTION%</string>
                </dict>
                <key>Processor</key>
                <string>JSSImporter</string>
            </dict>
        </array>
    </dict>
</plist>
