<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest version of the GlobalProtect.</string>
        <key>Identifier</key>
        <string>com.github.beatlemike.download.GlobalProtect</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>GlobalProtect</string>
        	<key>HOSTNAME</key>
        	<string>secure.csusb.edu</string>
        	<key>PLATFORM</key>
        	<string>mac</string>
        	<key>DOWNLOAD_URL</key>
        	<string>https://%HOSTNAME%/global-protect/getmsi.esp?platform=%PLATFORM%</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.6.1</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>URLDownloader</string>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>%DOWNLOAD_URL%</string>
                	<key>filename</key>
                	<string>%NAME%.pkg</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>FlatPkgUnpacker</string>
                <key>Arguments</key>
                <dict>
                    <key>flat_pkg_path</key>
                    <string>%pathname%</string>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/expand</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>PkgPayloadUnpacker</string>
                <key>Arguments</key>
                <dict>
                    <key>pkg_payload_path</key>
                    <string>%RECIPE_CACHE_DIR%/expand/gp.pkg/Payload</string>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/unpack</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>Versioner</string>
                <key>Arguments</key>
                <dict>
                    <key>input_plist_path</key>
                    <string>%RECIPE_CACHE_DIR%/unpack/Contents/Info.plist</string>
                    <key>plist_version_key</key>
                    <string>CFBundleShortVersionString</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>PkgCopier</string>
                <key>Arguments</key>
                <dict>
                    <key>source_pkg</key>
                    <string>%pathname%</string>
                    <key>pkg_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
                </dict>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>expected_authority_names</key>
                    <array>
                        <string>Developer ID Installer: Palo Alto Networks (PXPZ95SK77)</string>
                    	<string>Developer ID Certification Authority</string>
                        <string>Apple Root CA</string>
                    </array>
                    <key>input_path</key>
                    <string>%pathname%</string>
                </dict>
                <key>Processor</key>
                <string>CodeSignatureVerifier</string>
            </dict>
        </array>
    </dict>
</plist>
