<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
   <dict>
      <key>Description</key>
      <string>Downloads the current release version of the Logitech Camera Settings installer package and renames the installer package.</string>
      <key>Identifier</key>
      <string>com.github.beatlemike.pkg.LogitechCameraSettings</string>
      <key>Input</key>
      <dict>
         <key>NAME</key>
         <string>Logitech Camera Settings</string>
         <key>VENDOR</key>
         <string>Mozilla</string>
         <key>SOFTWARETITLE</key>
         <string>Logitech Camera Settings</string>
      </dict>
      <key>MinimumVersion</key>
      <string>1.0.0</string>
      <key>ParentRecipe</key>
      <string>com.github.neilmartin83-recipes.download.Logitech Camera Settings</string>
      <key>Process</key>
      <array>
		<dict>
			<key>Comment</key>
			<string>Get version from the app</string>
			<key>Processor</key>
			<string>Versioner</string>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%RECIPE_CACHE_DIR%/Applications/Camera Settings.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgCopier</string>
			<key>Arguments</key>
			<dict>
				<key>source_pkg</key>
				<string>%pathname%</string>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PathDeleter</string>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/unpack</string>
					<string>%RECIPE_CACHE_DIR%/Applications</string>
				</array>
			</dict>
		</dict>
	</array>
</dict>
</plist>