<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Uses parent download recipe to download the latest unlicensed Microsoft Powerpoint for Office 365 installer package and import it into the JSS.</string>
        <key>Identifier</key>
        <string>com.github.beatlemike.jss.MicrosoftPowerpoint365</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Microsoft Outlook</string>
            <key>CATEGORY</key>
            <string>Microsoft</string>
            <key>POLICY_CATEGORY</key>
            <string>Microsoft</string>
            <key>POLICY_TRIGGER</key>
            <string>powerpoint</string>
            <key>POLICY_TEMPLATE</key>
            <string>%RECIPE_DIR%/PolicyTemplate.xml</string>
            <key>ICON</key>
            <string>%RECIPE_DIR%/MicrosoftPowerpoint365.png</string>
            <key>DESCRIPTION</key>
            <string>PowerPoint is a slideshow presentation program that's part of the Microsoft office suite of tools. PowerPoint makes it easy to create, collaborate, and present your ideas in dynamic, visually compelling ways.</string>
        </dict>
        <key>MinimumVersion</key>
        <string>1.0.0</string>
        <key>ParentRecipe</key>
        <string>com.github.rtrouton.pkg.microsoftpowerpoint365</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>prod_name</key>
                    <string>%NAME%</string>
                    <key>category</key>
                    <string>%CATEGORY%</string>
                    <key>policy_category</key>
                    <string>%POLICY_CATEGORY%</string>
                    <key>trigger_other</key>
                    <string>%POLICY_TRIGGER%</string>
                    <key>policy_template</key>
                    <string>%POLICY_TEMPLATE%</string>
                    <key>self_service_icon</key>
                    <string>%ICON%</string>
                    <key>self_service_description</key>
                    <string>%DESCRIPTION%</string>
                </dict>
                <key>Processor</key>
                <string>JSSImporter</string>
            </dict>
        </array>
    </dict>
</plist>
