<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of the Microsoft Defender ATP installer package and renames the package and imports it into your JSS.</string>
	<key>Identifier</key>
	<string>com.github.beatlemike.jss.microsoftdefenderatp</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Microsoft Defender ATP</string>
		<key>CATEGORY</key>
		<string>Microsoft</string>
		<key>POLICY_CATEGORY</key>
		<string>Security</string>
		<key>POLICY_TRIGGER</key>
		<string>defender</string>
		<key>POLICY_TEMPLATE</key>
		<string>%RECIPE_DIR%/PolicyTemplate.xml</string>
		<key>ICON</key>
		<string>%RECIPE_DIR%/MicrosoftDefenderATP.png</string>
		<key>DESCRIPTION</key>
		<string>Microsoft Defender for Endpoint delivers preventative protection, post-breach detection, automated investigation, and response.</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.rtrouton.pkg.microsoftdefenderatp</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
                <dict>
                    <key>prod_name</key>
                    <string>%NAME%</string>
                    <key>category</key>
                    <string>%CATEGORY%</string>
                    <key>policy_category</key>
                    <string>%POLICY_CATEGORY%</string>
                    <key>trigger_other</key>
                    <string>%POLICY_TRIGGER%</string>
                    <key>policy_template</key>
                    <string>%POLICY_TEMPLATE%</string>
                    <key>self_service_icon</key>
                    <string>%ICON%</string>
                    <key>self_service_description</key>
                    <string>%DESCRIPTION%</string>
                </dict>
                <key>Processor</key>
                <string>JSSImporter</string>
            </dict>
        </array>
    </dict>
</plist>
