<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the current release version of MicrosoftOneDrive and uploads it to the JSS.</string>
        <key>Identifier</key>
        <string>com.github.beatlemike.jss.MicrosoftOneDrive</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Microsoft OneDrive</string>
            <key>CATEGORY</key>
            <string>Microsoft</string>
            <key>POLICY_CATEGORY</key>
            <string>Microsoft</string>
            <key>POLICY_TRIGGER</key>
            <string>onedrive</string>
            <key>POLICY_TEMPLATE</key>
            <string>%RECIPE_DIR%/PolicyTemplate.xml</string>
            <key>ICON</key>
            <string>%RECIPE_DIR%/MicrosoftOneDrive.png</string>
            <key>DESCRIPTION</key>
            <string>Keep your files protected and accessible on all your devices with Microsoft OneDrive. Easily share documents, photos, and other files with friends, family, and colleagues, and even collaborate in real-time in Office. OneDrive can help you quickly organize and find the things that matter most.

Anywhere access
Easily store, access and discover your personal and shared work files in Office 365, including Microsoft Teams, directly in Finder. Edits you make offline are automatically uploaded next time you connect.

Seamless collaboration
Work faster and smarter with anyone inside or outside your organization. Securely share files and work together in real-time using Word, Excel and PowerPoint across web, mobile and desktop.

Controls for security
OneDrive helps protect your files. You can easily recover files from accidental deletes or malicious attacks and administrators can manage security policies to help keep your information safe.

Note: For you to sign in to OneDrive for Business, your organization needs to have a qualifying SharePoint Online or Office 365 business subscription plan.</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.2.0</string>
        <key>ParentRecipe</key>
        <string>com.github.rtrouton.pkg.microsoftonedriv</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>prod_name</key>
                    <string>%NAME%</string>
                    <key>category</key>
                    <string>%CATEGORY%</string>
                    <key>policy_category</key>
                    <string>%POLICY_CATEGORY%</string>
                    <key>trigger_other</key>
                    <string>%POLICY_TRIGGER%</string>
                    <key>policy_template</key>
                    <string>%POLICY_TEMPLATE%</string>
                    <key>self_service_icon</key>
                    <string>%ICON%</string>
                    <key>self_service_description</key>
                    <string>%DESCRIPTION%</string>
                </dict>
                <key>Processor</key>
                <string>JSSImporter</string>
            </dict>
        </array>
    </dict>
</plist>
