<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest version of PowerShell and makes a pkg. Then, uploads to the JSS.</string>
        <key>Identifier</key>
        <string>com.github.beatlemike.jss.MicrosoftPowerShell</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>PowerShell</string>
            <key>CATEGORY</key>
            <string>Developer Tools</string>
            <key>POLICY_CATEGORY</key>
            <string>Developer Tools</string>
            <key>POLICY_TRIGGER</key>
            <string>powershell</string>
            <key>POLICY_TEMPLATE</key>
            <string>%RECIPE_DIR%/PolicyTemplate.xml</string>
            <key>ICON</key>
            <string>%RECIPE_DIR%/PowerShell.png</string>
            <key>DESCRIPTION</key>
            <string>PowerShell is a cross-platform task automation solution made up of a command-line shell, a scripting language, and a configuration management framework.</string>
        </dict>
        <key>MinimumVersion</key>
        <string>1.0.0</string>
        <key>ParentRecipe</key>
        <string>com.github.d33t5.pkg.PowerShell</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>prod_name</key>
                    <string>%NAME%</string>
                    <key>category</key>
                    <string>%CATEGORY%</string>
                    <key>policy_category</key>
                    <string>%POLICY_CATEGORY%</string>
                    <key>trigger_other</key>
                    <string>%POLICY_TRIGGER%</string>
                    <key>policy_template</key>
                    <string>%POLICY_TEMPLATE%</string>
                    <key>self_service_icon</key>
                    <string>%ICON%</string>
                    <key>self_service_description</key>
                    <string>%DESCRIPTION%</string>
                </dict>
                <key>Processor</key>
                <string>JSSImporter</string>
            </dict>
        </array>
    </dict>
</plist>
