<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of MiKTeX, creates a package, and uploads to the JSS.</string>
	<key>Identifier</key>
	<string>com.github.beatlemike.jss.MiKTeX</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>MiKTeX</string>
		<key>CATEGORY</key>
		<string>STEM</string>
		<key>POLICY_CATEGORY</key>
		<string>STEM</string>
        <key>POLICY_TRIGGER</key>
        <string>miktex</string>
        <key>POLICY_TEMPLATE</key>
        <string>%RECIPE_DIR%/PolicyTemplate.xml</string>
        <key>ICON</key>
		<string>MiKTeX.png</string>
		<key>DESCRIPTION</key>
		<string>MiKTeX is a modern TeX/LaTeX distribution.  It provides the tools necessary to prepare documents using the TeX/LaTeX markup language, as well as a simple TeX editor: TeXworks.</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.mlbz521.pkg.MiKTeX</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>prod_name</key>
                    <string>%NAME%</string>
                    <key>category</key>
                    <string>%CATEGORY%</string>
                    <key>policy_category</key>
                    <string>%POLICY_CATEGORY%</string>
                    <key>trigger_other</key>
                    <string>%POLICY_TRIGGER%</string>
                    <key>policy_template</key>
                    <string>%POLICY_TEMPLATE%</string>
                    <key>self_service_icon</key>
                    <string>%ICON%</string>
                    <key>self_service_description</key>
                    <string>%DESCRIPTION%</string>
                </dict>
                <key>Processor</key>
                <string>JSSImporter</string>
            </dict>
        </array>
</dict>
</plist>