<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Identifier</key>
        <string>com.github.beatlemike.jamf.MinecraftEdu-Client</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Minecraft Education Edition</string>
            <key>CATEGORY</key>
            <string>Developer Tools</string>
            <key>POLICY_CATEGORY</key>
            <string>Developer Tools</string>
			<key>POLICY_NAME</key>
			<string>Install - %NAME%</string>
			<key>POLICY_TEMPLATE</key>
			<string>JamfPolicyTemplateAllUsers.xml</string>
            <key>SELF_SERVICE_DESCRIPTION</key>
            <string>Minecraft: Education Edition is an educational version of Minecraft specifically designed for classroom use. It is being developed by Mojang AB and Microsoft Studios and contains features that make Minecraft easy to use in a classroom setting.</string>
            <key>SELF_SERVICE_ICON</key>
            <string>MinecraftEdu-Client.png</string>
            <key>POLICY_TRIGGER</key>
            <string>minecraft</string>
            <key>UPDATE_PREDICATE</key>
			<string>pkg_uploaded == False</string>
		</dict>
		<key>MinimumVersion</key>
		<string>2.3</string>
		<key>ParentRecipe</key>
        <string>com.github.haircut.pkg.MinecraftEdu-Client</string>
        <key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>pkg_category</key>
					<string>%CATEGORY%</string>
				</dict>
				<key>Processor</key>
				<string>com.github.grahampugh.jamf-upload.processors/JamfPackageUploader</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>predicate</key>
					<string>%UPDATE_PREDICATE%</string>
				</dict>
				<key>Processor</key>
				<string>StopProcessingIf</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>icon</key>
					<string>%SELF_SERVICE_ICON%</string>
					<key>policy_name</key>
					<string>%POLICY_NAME%</string>
					<key>policy_template</key>
					<string>%POLICY_TEMPLATE%</string>
					<key>replace_policy</key>
					<string>True</string>
				</dict>
				<key>Processor</key>
				<string>com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader</string>
			</dict>
		</array>
	</dict>
</plist>