<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of mmhmm and imports it into your JSS.</string>
	<key>Identifier</key>
	<string>com.github.beatlemike.jss.mmhmmstudio</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>mmhmm Studio</string>
            <key>CATEGORY</key>
            <string>Media</string>
            <key>POLICY_CATEGORY</key>
            <string>Media</string>
            <key>POLICY_TRIGGER</key>
            <string>mmhmm</string>
            <key>POLICY_TEMPLATE</key>
            <string>%RECIPE_DIR%/PolicyTemplate.xml</string>
            <key>ICON</key>
            <string>%RECIPE_DIR%/mmhmmstudio.png</string>
            <key>DESCRIPTION</key>
            <string>Present like a pro, or be present when you’re in the audience. With mmhmm, everyone on your team can make meetings better.</string>
       </dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.beatlemike.pkg.mmhmmstudio</string>
	<key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>prod_name</key>
                    <string>%NAME%</string>
                    <key>category</key>
                    <string>%CATEGORY%</string>
                    <key>policy_category</key>
                    <string>%POLICY_CATEGORY%</string>
                    <key>trigger_other</key>
                    <string>%POLICY_TRIGGER%</string>
                    <key>policy_template</key>
                    <string>%POLICY_TEMPLATE%</string>
                    <key>self_service_icon</key>
                    <string>%ICON%</string>
                    <key>self_service_description</key>
                    <string>%DESCRIPTION%</string>
                </dict>
                <key>Processor</key>
                <string>JSSImporter</string>
		</dict>
	</array>
</dict>
</plist>
