<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest OnyX client for macOS 11 Big Sur and builds a .pkg</string>
	<key>Identifier</key>
	<string>com.github.beatlemike.pkg.OnyXBigSur</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>OnyX for macOS Big Sur</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.1</string>
	<key>ParentRecipe</key>
	<string>com.github.beatlemike.download.OnyXBigSur</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
		</dict>
	</array>
</dict>
</plist>
