<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Uses parent pkg recipe to download the latest OnyX client for macOS 10.14 Mojave and import it into the JSS.</string>
        <key>Identifier</key>
        <string>com.github.beatlemike.jss.OnyX14</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>OnyX for macOS Mojave</string>
            <key>CATEGORY</key>
            <string>Utilities</string>
            <key>POLICY_CATEGORY</key>
            <string>Utilities</string>
            <key>POLICY_TRIGGER</key>
            <string>onyx</string>
            <key>POLICY_TEMPLATE</key>
            <string>%RECIPE_DIR%/PolicyTemplate.xml</string>
            <key>ICON</key>
            <string>%RECIPE_DIR%/Onyx14.png</string>
            <key>DESCRIPTION</key>
            <string>OnyX is a multifunction utility that you can use to verify the structure of the system files, to run miscellaneous maintenance and cleaning tasks, to configure parameters in the Finder, Dock, Safari, and some of Apple's applications, to delete caches, to remove certain problematic folders and files, to rebuild various databases and indexes, and more.</string>
        </dict>
        <key>MinimumVersion</key>
        <string>1.0.1</string>
        <key>ParentRecipe</key>
        <string>com.github.beatlemike.pkg.OnyX14</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>prod_name</key>
                    <string>%NAME%</string>
                    <key>pkg_path</key>
                    <string>%pathname%</string>
                    <key>category</key>
                    <string>%CATEGORY%</string>
                    <key>policy_category</key>
                    <string>%POLICY_CATEGORY%</string>
                    <key>trigger_other</key>
                    <string>%POLICY_TRIGGER%</string>
                    <key>policy_template</key>
                    <string>%POLICY_TEMPLATE%</string>
                    <key>self_service_icon</key>
                    <string>%ICON%</string>
                    <key>self_service_description</key>
                    <string>%DESCRIPTION%</string>
                    <key>pkg_path</key>
                    <string>%destination_path%</string>
                </dict>
                <key>Processor</key>
                <string>JSSImporter</string>
            </dict>
        </array>
    </dict>
</plist>
