<policy>
	<general>
		<name>Install - %PROD_NAME%</name>
		<enabled>true</enabled>
		<trigger_other>%POLICY_TRIGGER%</trigger_other>
    <frequency>Ongoing</frequency>
		<category>
			<name>%POLICY_CATEGORY%</name>
		</category>
	</general>
	<scope>
		<all_computers>true</all_computers>
	</scope>
	<package_configuration>
		<!--Package added by JSSImporter-->
	</package_configuration>
	<scripts>
		<!--Scripts added by JSSImporter-->
	</scripts>
	<self_service>
		<use_for_self_service>true</use_for_self_service>
		<install_button_text>Install</install_button_text>
		<self_service_display_name>%PROD_NAME%</self_service_display_name>
		<reinstall_button_text>Reinstall</reinstall_button_text>
		<self_service_description>%SELF_SERVICE_DESCRIPTION%</self_service_description>
	</self_service>
	<reboot>
    	<message>This computer will restart in 5 minutes. Please save anything you are working on and log out by choosing Log Out from the bottom of the Apple menu.</message>
    	<startup_disk>Current Startup Disk</startup_disk>
    	<specify_startup/>
    	<no_user_logged_in>Do not restart</no_user_logged_in>
    	<user_logged_in>Do not restart</user_logged_in>
    	<minutes_until_reboot>5</minutes_until_reboot>
    	<start_reboot_timer_immediately>false</start_reboot_timer_immediately>
    	<file_vault_2_reboot>false</file_vault_2_reboot>
	</reboot>
	<maintenance>
		<recon>true</recon>
	</maintenance>
</policy>