<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest version of the Pulse Secure.</string>
        <key>Identifier</key>
        <string>com.github.beatlemike.pkg.PulseSecure</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Pulse Secure</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.6.1</string>
        <key>ParentRecipe</key>
    	<string>com.github.beatlemike.download.PulseSecure</string>
        <key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>Copier</string>
				<key>Arguments</key>
				<dict>
					<key>source_path</key>
					<string>%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg/*.pkg</string>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%.pkg</string>
				</dict>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
				   <key>destination_path</key>
				   <string>%RECIPE_CACHE_DIR%/unpack</string>
				   <key>flat_pkg_path</key>
				   <string>%RECIPE_CACHE_DIR%/%NAME%.pkg</string>
				</dict>
				<key>Processor</key>
				<string>FlatPkgUnpacker</string>
			 </dict>
			 <dict>
                <key>Processor</key>
                <string>Versioner</string>
                <key>Arguments</key>
                <dict>
                    <key>input_plist_path</key>
                    <string>%RECIPE_CACHE_DIR%/downloads/Pulse\ Secure.dmg/PulseSecure.pkg/Applications/Pulse Secure.app/Contents/Info.plist</string>
                    <key>plist_version_key</key>
                    <string>CFBundleShortVersionString</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>PkgCopier</string>
                <key>Arguments</key>
                <dict>
                    <key>source_pkg</key>
                    <string>%pathname%</string>
                    <key>pkg_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
                </dict>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>expected_authority_names</key>
                    <array>
                        <string>Developer ID Installer: Palo Alto Networks (PXPZ95SK77)</string>
                    	<string>Developer ID Certification Authority</string>
                        <string>Apple Root CA</string>
                    </array>
                    <key>input_path</key>
                    <string>%pathname%</string>
                </dict>
                <key>Processor</key>
                <string>CodeSignatureVerifier</string>
            </dict>
      </array>
   </dict>
</plist>
