<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest version of the Pulse Secure.</string>
        <key>Identifier</key>
        <string>com.github.beatlemike.pkg.PulseSecure</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Pulse Secure</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.6.1</string>
        <key>ParentRecipe</key>
    	<string>com.github.beatlemike.download.PulseSecure</string>
        <key>Process</key>
        <array>
            <dict>
            	<key>Processor</key>
            	<string>FlatPkgUnpacker</string>
            	<key>Arguments</key>
            	<dict>
                	<key>flat_pkg_path</key>
                	<string>%pathname%/*.pkg</string>
                	<key>destination_path</key>
                	<string>%RECIPE_CACHE_DIR%/unpack</string>
                	<key>purge_destination</key>
                	<true/>
            	</dict>
        	</dict>
            <dict>
            	<key>Processor</key>
            	<string>Versioner</string>
            	<key>Arguments</key>
            	<dict>
                	<key>input_plist_path</key>
                	<string>%RECIPE_CACHE_DIR%/unpack/Distribution</string>
            	</dict>
        	</dict>
        	<dict>
            	<key>Processor</key>
            	<string>PkgCopier</string>
            	<key>Arguments</key>
            	<dict>
                	<key>source_pkg</key>
                	<string>%pathname%/*.pkg</string>
                	<key>pkg_path</key>
                	<string>%RECIPE_CACHE_DIR%/Pulse Secure-%version%.pkg</string>
            	</dict>
        	</dict>
        </array>
    </dict>
</plist>
