<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest version of the Pulse Secure.</string>
        <key>Identifier</key>
        <string>com.github.beatlemike.pkg.PulseSecure</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Pulse Secure</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.6.1</string>
        <key>ParentRecipe</key>
    	<string>com.github.beatlemike.download.PulseSecure</string>
        <key>Process</key>
        <array>
        	<dict>
            	<key>Processor</key>
            	<string>PkgRootCreator</string>
            	<key>Arguments</key>
            	<dict>
                	<key>pkgroot</key>
                	<string>%RECIPE_CACHE_DIR%/%NAME%</string>
                	<key>pkgdirs</key>
                	<dict>
                    	<key>Package</key>
                    	<string>0775</string>
                	</dict>
            	</dict>
        	</dict>
            <dict>
            	<key>Processor</key>
            	<string>Copier</string>
            	<key>Arguments</key>
            	<dict>
                	<key>source_path</key>
                	<string>%pathname%/*.pkg</string>
                	<key>destination_path</key>
                	<string>%pkgroot%/Package/%NAME%.pkg</string>
            	</dict>
        	</dict>
        	<dict>
            	<key>Arguments</key>
            	<dict>
               		<key>destination_path</key>
               		<string>%RECIPE_CACHE_DIR%/downloads/payload</string>
               		<key>pkg_payload_path</key>
               		<string>%pkgroot%/Package</string>
            	</dict>
            	<key>Processor</key>
            	<string>PkgPayloadUnpacker</string>
         	</dict>
         	<dict>
            	<key>Arguments</key>
            	<dict>
               		<key>input_plist_path</key>
               		<string>%RECIPE_CACHE_DIR%/downloads/payload/Pulse Secure.app/Contents/Info.plist</string>
               		<key>plist_version_key</key>
               		<string>CFBundleVersion</string>
            	</dict>
            	<key>Processor</key>
            	<string>Versioner</string>
         	</dict>
        </array>
    </dict>
</plist>
