<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest version of the Pulse Secure.</string>
        <key>Identifier</key>
        <string>com.github.beatlemike.pkg.PulseSecure</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Pulse Secure</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.6.1</string>
        <key>ParentRecipe</key>
    	<string>com.github.beatlemike.download.PulseSecure</string>
        <key>Process</key>
        <array>
        	<dict>
				<key>Processor</key>
				<string>PkgRootCreator</string>
				<key>Arguments</key>
				<dict>
					<key>pkgroot</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%-pkg</string>
					<key>pkgdirs</key>
					<dict>
						<key>Applications</key>
						<string>0775</string>
					</dict>
				</dict>
			</dict>
            <dict>
            	<key>Processor</key>
            	<string>PkgCopier</string>
            	<key>Arguments</key>
            	<dict>
                	<key>source_pkg</key>
                	<string>%pathname%/*.pkg</string>
                	<key>pkg_path</key>
                	<string>%RECIPE_CACHE_DIR%/Pulse Secure-%version%.pkg</string>
            	</dict>
        	</dict>
        </array>
    </dict>
</plist>
