<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads Respondus LockDown Browser.</string>
		<key>Identifier</key>
		<string>com.github.beatlemike.pkg.Respondus</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>Respondus LockDown Browser</string>
			<key>INSTITUTION_ID</key>
			<string>688284602</string>
			<key>LAB_HASH</key>
			<string>9325f88657a93a7fcd7b515a278ea09f</string>
		</dict>
		<key>MinimumVersion</key>
		<string>0.4.0</string>
		<key>ParentRecipe</key>
		<string>com.github.aysiu.download.LockDownBrowserLab</string>
		<key>Process</key>
		<array/>
	</dict>
</plist>
