<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads Respondus LockDown Browser and imports into JSS.</string>
		<key>Identifier</key>
		<string>com.github.beatlemike.jss.Respondus</string>
		<key>Input</key>
		<dict>
			<key>INSTITUTION_ID</key>
			<string>688284602</string>
			<key>LAB_HASH</key>
			<string>9325f88657a93a7fcd7b515a278ea09f</string>
			<key>NAME</key>
			<string>Install Respondus LockDown Browser (x64c) %INSTITUTION_ID%{%LAB_HASH%}</string>
			<key>CATEGORY</key>
			<string>CSUSB</string>
			<key>POLICY_CATEGORY</key>
			<string>CSUSB</string>
			<key>POLICY_TRIGGER</key>
			<string>respondus</string>
			<key>POLICY_TEMPLATE</key>
			<string>%RECIPE_DIR%/PolicyTemplate.xml</string>
			<key>ICON</key>
			<string>%RECIPE_DIR%/Respondus.png</string>
			<key>DESCRIPTION</key>
			<string>LockDown Browser® is a custom browser that locks down the testing environment within a learning management system. Used at over 1500 higher educational institutions, LockDown Browser is the “gold standard” for securing online exams in classrooms or proctored environments.</string>
		</dict>
		<key>MinimumVersion</key>
		<string>0.4.0</string>
		<key>ParentRecipe</key>
		<string>com.github.aysiu.download.LockDownBrowserLab</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>prod_name</key>
					<string>%NAME%</string>
					<key>category</key>
					<string>%CATEGORY%</string>
					<key>policy_category</key>
					<string>%POLICY_CATEGORY%</string>
					<key>trigger_other</key>
					<string>%POLICY_TRIGGER%</string>
					<key>policy_template</key>
					<string>%POLICY_TEMPLATE%</string>
					<key>self_service_icon</key>
					<string>%ICON%</string>
					<key>self_service_description</key>
					<string>%DESCRIPTION%</string>
				</dict>
				<key>Processor</key>
				<string>JSSImporter</string>
			</dict>
		</array>
	</dict>
</plist>
