<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the current release version of Silverlight and uploads it to the JSS.</string>
        <key>Identifier</key>
        <string>com.github.beatlemike.jss.Silverlight</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Silverlight</string>
            <key>CATEGORY</key>
            <string>Additional Installs</string>
            <key>POLICY_CATEGORY</key>
            <string>Additional Installs/string>
            <key>POLICY_TRIGGER</key>
            <string>silverlight</string>
            <key>POLICY_TEMPLATE</key>
            <string>%RECIPE_DIR%/PolicyTemplateDisabled.xml</string>
            <key>ICON</key>
            <string>%RECIPE_DIR%/Silverlight.png</string>
            <key>DESCRIPTION</key>
            <string>Silverlight is a free plug-in, powered by the .NET framework and compatible with multiple browsers, devices and operating systems, bringing a new level of interactivity wherever the Web works.</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.2.0</string>
        <key>ParentRecipe</key>
        <string>com.github.autopkg.pkg.Silverlight</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>prod_name</key>
                    <string>%NAME%</string>
                    <key>category</key>
                    <string>%CATEGORY%</string>
                    <key>policy_category</key>
                    <string>%POLICY_CATEGORY%</string>
                    <key>trigger_other</key>
                    <string>%POLICY_TRIGGER%</string>
                    <key>policy_template</key>
                    <string>%POLICY_TEMPLATE%</string>
                    <key>self_service_icon</key>
                    <string>%ICON%</string>
                    <key>self_service_description</key>
                    <string>%DESCRIPTION%</string>
                </dict>
                <key>Processor</key>
                <string>JSSImporter</string>
            </dict>
        </array>
    </dict>
</plist>
