<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the current release version of Spotify and uploads it to the JSS.</string>
        <key>Identifier</key>
        <string>com.github.beatlemike.jss.Spotify</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Spotify</string>
            <key>CATEGORY</key>
            <string>Music</string>
            <key>POLICY_CATEGORY</key>
            <string>Music</string>
            <key>POLICY_TRIGGER</key>
            <string>spotify</string>
            <key>POLICY_TEMPLATE</key>
            <string>%RECIPE_DIR%/PolicyTemplate.xml</string>
            <key>ICON</key>
            <string>%RECIPE_DIR%/Spotify.png</string>
            <key>DESCRIPTION</key>
            <string>With Spotify, it’s easy to find the right music or podcast for every moment – on your phone, your computer, your tablet and more.</string>
        </dict>
        <key>MinimumVersion</key>
        <string>1.0.0</string>
        <key>ParentRecipe</key>
        <string>com.github.homebysix.pkg.Spotify</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>prod_name</key>
                    <string>%NAME%</string>
                    <key>pkg_path</key>
                	<string>%pkg_path%</string>
                    <key>category</key>
                    <string>%CATEGORY%</string>
                    <key>policy_category</key>
                    <string>%POLICY_CATEGORY%</string>
                    <key>trigger_other</key>
                    <string>%POLICY_TRIGGER%</string>
                    <key>policy_template</key>
                    <string>%POLICY_TEMPLATE%</string>
                    <key>self_service_icon</key>
                    <string>%ICON%</string>
                    <key>self_service_description</key>
                    <string>%DESCRIPTION%</string>
                </dict>
                <key>Processor</key>
                <string>JSSImporter</string>
            </dict>
        </array>
    </dict>
</plist>
