<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Identifier</key>
        <string>com.github.beatlemike.jamf.swiftDialog</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>swiftDialog</string>
            <key>CATEGORY</key>
            <string>Utilities</string>
            <key>POLICY_CATEGORY</key>
            <string>Utilities</string>
            <key>POLICY_NAME</key>
            <string>Install - %NAME%</string>
            <key>POLICY_TEMPLATE</key>
            <string>JamfPolicyTemplateAllUsers.xml</string>
            <key>SELF_SERVICE_DESCRIPTION</key>
            <string>swiftDialog is an open source admin utility app for macOS 11+ written in SwiftUI that displays a popup dialog, displaying the content to your users that you want to display.</string>
            <key>SELF_SERVICE_ICON</key>
            <string>swiftDialog.png</string>
            <key>POLICY_TRIGGER</key>
            <string>swiftdialog</string>
            <key>UPDATE_PREDICATE</key>
            <string>pkg_uploaded == False</string>
		</dict>
		<key>MinimumVersion</key>
		<string>2.3</string>
		<key>ParentRecipe</key>
        <string>com.github.autopkg.precursorca.pkg.swiftdialog</string>
        <key>Process</key>
		    <array>
			    <dict>
				    <key>Arguments</key>
				    <dict>
					    <key>pkg_category</key>
					    <string>%CATEGORY%</string>
				    </dict>
				    <key>Processor</key>
				    <string>com.github.grahampugh.jamf-upload.processors/JamfPackageUploader</string>
			    </dict>
			    <dict>
				    <key>Arguments</key>
				    <dict>
					    <key>predicate</key>
					    <string>%UPDATE_PREDICATE%</string>
				    </dict>
				    <key>Processor</key>
				    <string>StopProcessingIf</string>
			    </dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>icon</key>
					<string>%SELF_SERVICE_ICON%</string>
					<key>policy_name</key>
					<string>%POLICY_NAME%</string>
					<key>policy_template</key>
					<string>%POLICY_TEMPLATE%</string>
					<key>replace_policy</key>
					<string>True</string>
				</dict>
				<key>Processor</key>
				<string>com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader</string>
			</dict>
		</array>
	</dict>
</plist>
