<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the current release version of TeamViewer and uploads it to the JSS.</string>
        <key>Identifier</key>
        <string>com.github.beatlemike.jss.TeamViewer15</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>TeamViewer</string>
            <key>CATEGORY</key>
            <string>Remote Access</string>
            <key>POLICY_CATEGORY</key>
            <string>Remote Access</string>
            <key>POLICY_TRIGGER</key>
            <string>teamviewer</string>
            <key>POLICY_TEMPLATE</key>
            <string>%RECIPE_DIR%/PolicyTemplate.xml</string>
            <key>ICON</key>
            <string>%RECIPE_DIR%/TeamViewer.png</string>
            <key>DESCRIPTION</key>
            <string>Establish incoming and outgoing remote desktop and computer-to-computer connections for real-time support or access to files, networks and programs. Collaborate online, participate in meetings, chat with other people or groups, and make video calls in one click. After downloading and installing this software, you'll have your first session up and running within seconds.</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.2.0</string>
        <key>ParentRecipe</key>
        <string>com.justinrummel.pkg.TeamViewer</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>prod_name</key>
                    <string>%NAME%</string>
                    <key>category</key>
                    <string>%CATEGORY%</string>
                    <key>policy_category</key>
                    <string>%POLICY_CATEGORY%</string>
                    <key>trigger_other</key>
                    <string>%POLICY_TRIGGER%</string>
                    <key>policy_template</key>
                    <string>%POLICY_TEMPLATE%</string>
                    <key>self_service_icon</key>
                    <string>%ICON%</string>
                    <key>self_service_description</key>
                    <string>%DESCRIPTION%</string>
                </dict>
                <key>Processor</key>
                <string>JSSImporter</string>
            </dict>
        </array>
    </dict>
</plist>
