<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads Camtasia disk image, builds a package, and imports into JSS. The installer package includes a preinstall script that will check for an existing "Camtasia 3.app" in /Applications and remove it if found.</string>
    <key>Identifier</key>
    <string>com.github.autopkg.kernsb.jss.TechSmithCamtasia</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Camtasia</string>
        <key>CATEGORY</key>
        <string>Design</string>
        <key>POLICY_CATEGORY</key>
        <string>Design</string>
        <key>POLICY_TRIGGER</key>
        <string>camtasia</string>
        <key>POLICY_TEMPLATE</key>
        <string>%RECIPE_DIR%/PolicyTemplate.xml</string>
        <key>SELF_SERVICE_ICON</key>
        <string>%RECIPE_DIR%/Camtasia.png</string>
        <key>SELF_SERVICE_DESCRIPTION</key>
        <string>Powerful, yet easy-to-use, Camtasia helps you create professional videos without having to be a video pro. Easily record your on-screen activity or import HD camera video, customize and edit content, and share your videos with viewers on nearly any device.</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>ParentRecipe</key>
    <string>com.github.autopkg.kernsb.pkg.TechSmithCamtasia</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>prod_name</key>
                <string>%NAME%</string>
                <key>category</key>
                <string>%CATEGORY%</string>
                <key>policy_category</key>
                <string>%POLICY_CATEGORY%</string>
                <key>trigger_other</key>
                <string>%POLICY_TRIGGER%</string>
                <key>policy_template</key>
                <string>%POLICY_TEMPLATE%</string>
                <key>self_service_icon</key>
                <string>%SELF_SERVICE_ICON%</string>
                <key>self_service_description</key>
                <string>%SELF_SERVICE_DESCRIPTION%</string>
            </dict>
            <key>Processor</key>
            <string>JSSImporter</string>
        </dict>
    </array>
</dict>
</plist>
