<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the current release version of TechSmith Camtasia and uploads it to the JSS.</string>
        <key>Identifier</key>
        <string>com.github.beatlemike.jss.TechSmithCamtasia</string>
        <key>Input</key>
        <dict>
			<key>CAMTASIA_KEY</key>
			<string>fffe48005a004300380042002d00320043004d00530033002d00530052004600350044002d004d0041005000430033002d0034004400440041003200</string>
            <key>NAME</key>
            <string>TechSmith Camtasia</string>
            <key>CATEGORY</key>
            <string>Design</string>
            <key>POLICY_CATEGORY</key>
            <string>Design</string>
            <key>POLICY_TRIGGER</key>
            <string>camtasia</string>
            <key>POLICY_TEMPLATE</key>
            <string>%RECIPE_DIR%/PolicyTemplate.xml</string>
            <key>ICON</key>
            <string>%RECIPE_DIR%/TechSmithCamtasia.png</string>
            <key>DESCRIPTION</key>
            <string>Camtasia is a software suite, created and published by TechSmith, for creating video tutorials and presentations directly via screencast, or via a direct recording plug-in to Microsoft PowerPoint.</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.2.0</string>
        <key>ParentRecipe</key>
        <string>com.github.autopkg.kernsb.pkg.TechSmithCamtasia</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>prod_name</key>
                    <string>%NAME%</string>
                    <key>category</key>
                    <string>%CATEGORY%</string>
                    <key>policy_category</key>
                    <string>%POLICY_CATEGORY%</string>
                    <key>trigger_other</key>
                    <string>%POLICY_TRIGGER%</string>
                    <key>policy_template</key>
                    <string>%POLICY_TEMPLATE%</string>
                    <key>self_service_icon</key>
                    <string>%ICON%</string>
                    <key>self_service_description</key>
                    <string>%DESCRIPTION%</string>
                </dict>
                <key>Processor</key>
                <string>JSSImporter</string>
            </dict>
        </array>
    </dict>
</plist>
