<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest version of the GlobalProtect.</string>
        <key>Identifier</key>
        <string>com.github.beatlemike.download.GlobalProtect</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>GlobalProtect</string>
        	<key>HOSTNAME</key>
        	<string>vpn.example.com</string>
        	<key>PLATFORM</key>
        	<string>mac</string>
        	<key>DOWNLOAD_URL</key>
        	<string>https://%HOSTNAME%/global-protect/getmsi.esp?platform=%PLATFORM%</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.6.1</string>
        <key>Process</key>
        <array>
            <dict>
				<key>Arguments</key>
				<dict>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%</string>
					<key>flat_pkg_path</key>
					<string>%pathname%</string>
				</dict>
				<key>Processor</key>
				<string>FlatPkgUnpacker</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%</string>
					<key>pkg_payload_path</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%/gp.pkg/Payload</string>
				</dict>
				<key>Processor</key>
				<string>PkgPayloadUnpacker</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%/%NAME%.app/Contents</string>
					<key>source_path</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%/Contents</string>
				</dict>
				<key>Processor</key>
				<string>Copier</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>input_plist_path</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%/%NAME%.app/Contents/Info.plist</string>
				</dict>
				<key>Processor</key>
				<string>Versioner</string>
			</dict>
            <dict>
                <key>Processor</key>
                <string>PkgCopier</string>
                <key>Arguments</key>
                <dict>
                    <key>source_pkg</key>
                    <string>%pathname%</string>
                    <key>pkg_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
                </dict>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>expected_authority_names</key>
                    <array>
                        <string>Developer ID Installer: Palo Alto Networks (PXPZ95SK77)</string>
                    	<string>Developer ID Certification Authority</string>
                        <string>Apple Root CA</string>
                    </array>
                    <key>input_path</key>
                    <string>%pathname%</string>
                </dict>
                <key>Processor</key>
                <string>CodeSignatureVerifier</string>
            </dict>
        </array>
    </dict>
</plist>
